# Associate Only
## Exam DS102: Data Management, Modeling, and Programming in R or Python

# 2.1 Perform standard data import, joining and aggregation tasks

- Import data from flat files into Python.

In [23]:
# csv data using pandas
import pandas as pd

csv_path = '/home/nero/Documents/Estudos/DataCamp/Data_Science_Professional_certification_study/Exam_DS102/datasets/sample_csv.csv'

csv_data = pd.read_csv(csv_path)

display(csv_data.head())

# import text

with open(csv_path) as file:
    text = file.read()
    print(text)
    file.close()

   Store ID Store Name  Sales
0         1    Store 1  10000
1         2    Store 2  20000
2         3    Store 3  30000
3         4    Store 4  40000
4         5    Store 5  50000

Store ID,Store Name,Sales
1,Store 1,10000
2,Store 2,20000
3,Store 3,30000
4,Store 4,40000
5,Store 5,50000

- Import data from databases into  Python

In [24]:
"""# sample code 

import mysql.connector

# Connect to the database.
conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="password",
    database="mydatabase",
)

# Create a cursor object.
cursor = conn.cursor()

# Execute a query to select all data from the `store_sales` table.
cursor.execute("SELECT * FROM store_sales")

# Fetch the results of the query.
results = cursor.fetchall()

# Close the cursor object.
cursor.close()

# Close the connection to the database.
conn.close()

# Print the results of the query.
for row in results:
    print(row)
"""

'# sample code \n\nimport mysql.connector\n\n# Connect to the database.\nconn = mysql.connector.connect(\n    host="localhost",\n    user="root",\n    password="password",\n    database="mydatabase",\n)\n\n# Create a cursor object.\ncursor = conn.cursor()\n\n# Execute a query to select all data from the `store_sales` table.\ncursor.execute("SELECT * FROM store_sales")\n\n# Fetch the results of the query.\nresults = cursor.fetchall()\n\n# Close the cursor object.\ncursor.close()\n\n# Close the connection to the database.\nconn.close()\n\n# Print the results of the query.\nfor row in results:\n    print(row)\n'

- Aggregate numeric, categorical variables and dates by groups using Python

In [25]:
# load sample data 
from sklearn.datasets import  load_iris
import pandas as pd

data = load_iris(as_frame=True)
iris = pd.concat([data.data, data.target], axis=1)

map_names = {
    0 : data.target_names[0],
    1 : data.target_names[1],
    2 : data.target_names[2]
}

iris['target'] = iris['target'].replace(map_names)

iris.head()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),target
0,5.1,3.5,1.4,0.2,setosa
1,4.9,3.0,1.4,0.2,setosa
2,4.7,3.2,1.3,0.2,setosa
3,4.6,3.1,1.5,0.2,setosa
4,5.0,3.6,1.4,0.2,setosa

In [26]:
display(iris.groupby('target').agg('mean'))
display(iris.groupby("target")["sepal length (cm)"].mean())
display(iris.groupby("target").size())
display(iris.groupby("target")["petal width (cm)"].mean().sort_values(ascending=False))
display(iris.groupby("target")["sepal length (cm)"].agg(["mean", "std", "min", "max"]))

import numpy as np
def square_and_mean(x):
    return np.mean(x ** 2)

display(iris.groupby("target")[["sepal length (cm)", "petal width (cm)"]].agg({"sepal length (cm)": "mean", "petal width (cm)": square_and_mean}))

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
target,,,,
setosa,5.006,3.428,1.462,0.246
versicolor,5.936,2.770,4.260,1.326
virginica,6.588,2.974,5.552,2.026

target
setosa        5.006
versicolor    5.936
virginica     6.588
Name: sepal length (cm), dtype: float64

target
setosa        50
versicolor    50
virginica     50
dtype: int64

target
virginica     2.026
versicolor    1.326
setosa        0.246
Name: petal width (cm), dtype: float64

             mean       std  min  max
target
setosa      5.006  0.352490  4.3  5.8
versicolor  5.936  0.516171  4.9  7.0
virginica   6.588  0.635880  4.9  7.9

            sepal length (cm)  petal width (cm)
target
setosa                  5.006            0.0714
versicolor              5.936            1.7966
virginica               6.588            4.1786

- Combine multiple tables by rows or columns using  Python.

In [27]:
# Combine two tables by rows
df1 = pd.DataFrame({"id": [1, 2, 3], "name": ["Alice", "Bob", "Carol"]})
df2 = pd.DataFrame({"id": [4, 5, 6], "name": ["Dave", "Eve", "Frank"]})

display(pd.concat([df1, df2], axis=1))
display(pd.concat([df1, df2], axis=0))

# merged

df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [1, 2, 3, 5]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [5, 6, 7, 8]})

df1.merge(df2, left_on='lkey', right_on='rkey')

   id   name  id   name
0   1  Alice   4   Dave
1   2    Bob   5    Eve
2   3  Carol   6  Frank

   id   name
0   1  Alice
1   2    Bob
2   3  Carol
0   4   Dave
1   5    Eve
2   6  Frank

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

-  Filter data based on different criteria using R or Python.

In [28]:
# filter iris dataset based on the length of the sepal

# using pandas .loc
display(iris.loc[iris['sepal length (cm)'] > 7])

# using numpy (Returns the index)
display(np.where(iris['sepal length (cm)']>7))


# filter iris dataset based on the area of the petal

# using pandas
display(iris.loc[iris['petal length (cm)'] * iris['petal width (cm)'] > 15])

# using numpy (Returns the index)
display(np.where(iris['petal length (cm)'] * iris['petal width (cm)'] > 15))

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),target
102,7.1,3.0,5.9,2.1,virginica
105,7.6,3.0,6.6,2.1,virginica
107,7.3,2.9,6.3,1.8,virginica
109,7.2,3.6,6.1,2.5,virginica
117,7.7,3.8,6.7,2.2,virginica
118,7.7,2.6,6.9,2.3,virginica
122,7.7,2.8,6.7,2.0,virginica
125,7.2,3.2,6.0,1.8,virginica
129,7.2,3.0,5.8,1.6,virginica
130,7.4,2.8,6.1,1.9,virginica
131,7.9,3.8,6.4,2.0,virginica
135,7.7,3.0,6.1,2.3,virginica

(array([102, 105, 107, 109, 117, 118, 122, 125, 129, 130, 131, 135]),)

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),target
109,7.2,3.6,6.1,2.5,virginica
118,7.7,2.6,6.9,2.3,virginica

(array([109, 118]),)

# 2.2 Perform standard cleaning tasks to prepare data for analysis

- Match strings in a dataset with specific patterns using R or Python.

In [29]:
# tweets path
tweets = pd.read_csv("/home/nero/Documents/Estudos/DataCamp/Python/projects/Who's Tweeting? Trump or Trudeau?/datasets/tweets.csv")

import re
# using pandas .str.contains (Returns True/False list)
display(tweets.loc[tweets['status'].str.contains('@')])

# using pandas .str.extract (Returns extracted regex found)
pattern = r"(@\w+)"
display(tweets['status'].str.extractall(pattern))

# Using only re 
mentions = []

for t in tweets.status:
    ment = re.findall(pattern, t)
    if ment != []:
        mentions.append(ment)

print(mentions)

      id           author                                             status
0      1  Donald J. Trump  I will be making a major statement from the @W...
3      4  Donald J. Trump  Great to see @RandPaul looking well and back o...
27    28  Donald J. Trump  I am leaving China for #APEC2017 in Vietnam. @...
35    36  Donald J. Trump  On behalf of @FLOTUS Melania and I, THANK YOU ...
45    46  Donald J. Trump  Franklin, such a great photo. \n\nHAPPY 99th B...
..   ...              ...                                                ...
393  394   Justin Trudeau  Great chat with @ericschmidt, talking about ho...
394  395   Justin Trudeau  Bonne discussion avec @ericschmidt sur l’inves...
395  396   Justin Trudeau  RT @googlecanada: Watch tmw: @JustinTrudeau di...
398  399   Justin Trudeau  RT @VeteransENG_CA: #Day1 of 11 Days of Rememb...
399  400   Justin Trudeau  RT @VeteransFR_CA: #Jour1 des 11 jours pour se...

[144 rows x 3 columns]

                         0
    match
0   0          @WhiteHouse
3   0            @RandPaul
27  0              @FLOTUS
35  0              @FLOTUS
45  0         @BillyGraham
...                    ...
395 1       @JustinTrudeau
    2         @ericschmidt
    3             @nytimes
398 0      @VeteransENG_CA
399 0       @VeteransFR_CA

[185 rows x 1 columns]

[['@WhiteHouse'], ['@RandPaul'], ['@FLOTUS'], ['@FLOTUS'], ['@BillyGraham'], ['@EdWGillespie'], ['@EdWGillespie'], ['@AbeShinzo', '@realDonaldTrump'], ['@USForcesJapan'], ['@IvankaTrump'], ['@PacificCommand', '@USSArizona'], ['@PacificCommand'], ['@IngrahamAngle', '@FoxNews'], ['@TuckerCarlson'], ['@Broadcom'], ['@Astros'], ['@Cabinet'], ['@garyplayer'], ['@SenateMajLdr', '@SenateGOP'], ['@SenateMajLdr', '@SenateGOP'], ['@NYGovCuomo', '@NYCMayor'], ['@NYGovCuomo', '@NYCMayor'], ['@foxandfriends'], ['@foxandfriends'], ['@IvankaTrump'], ['@LuisRiveraMarin'], ['@foxandfriends'], ['@TheLeeGreenwood'], ['@FoxNews'], ['@FLGovScott'], ['@TheLeeGreenwood'], ['@Joy_Villa'], ['@SpeakerRyan', '@GOPLeader', '@SteveScalise'], ['@foxandfriends'], ['@seanhannity'], ['@PChowka'], ['@IvankaTrump'], ['@LouDobbs', '@FoxBusiness'], ['@GovAbbott', '@DanPatrick'], ['@LouDobbs', '@FoxBusiness'], ['@Reince'], ['@FoxNews'], ['@NavdeepSBains'], ['@NavdeepSBains'], ['@FP_Champagne'], ['@FP_Champagne'], ['@yuchengcomuseum', '@JustinTrudeau'], ['@cathmckenna'], ['@cathmckenna'], ['@jacindaardern'], ['@jacindaardern'], ['@APEC'], ['@SeamusORegan'], ['@RoyalCdnLegion'], ['@RoyalCdnLegion'], ['@CanadianForces'], ['@ForcesCanada'], ['@NationalDefence'], ['@DefenseCanada'], ['@BobRae48'], ['@BobRae48'], ['@sherylsandberg'], ['@sherylsandberg'], ['@TurnbullMalcolm'], ['@TurnbullMalcolm'], ['@AbeShinzo'], ['@AbeShinzo'], ['@EPN'], ['@EPN'], ['@MarcMillerVM'], ['@MarcMillerVM'], ['@SeamusORegan'], ['@SeamusORegan'], ['@VeteransENG_CA'], ['@VeteransFR_CA'], ['@RalphGoodale', '@rcmpgrcpolice'], ['@RalphGoodale', '@rcmpgrcpolice'], ['@jyduclos'], ['@jyduclos'], ['@VNXAllshares'], ['@JulieDzerowicz', '@OurCommons'], ['@DrRobbieO'], ['@SherryRomanado'], ['@SherryRomanado'], ['@AsiaPacificFdn', '@JustinTrudeau', '@Stewartbeck'], ['@KirstyDuncanMP', '@cathmckenna'], ['@KirstyDuncanMP', '@cathmck'], ['@FP_Champagne'], ['@cafreeland'], ['@cafreeland'], ['@janephilpott'], ['@SeamusORegan'], ['@liberal_party'], ['@parti_liberal'], ['@BlueJays'], ['@cathmckenna', '@StellaBowles'], ['@cathmckenna', '@StellaBowles'], ['@Carolyn_Bennett', '@ITK_CanadaInuit'], ['@Carolyn_Bennett', '@ITK_CanadaInuit'], ['@PattyHajdu'], ['@PattyHajdu'], ['@AbbyPoliceDept'], ['@SeamusORegan', '@RoyalCd'], ['@SeamusORegan', '@RoyalCdnLegio'], ['@AbbyPoliceDept'], ['@AbbyPoliceDept'], ['@GregAbbott_TX'], ['@GregAbbott_TX'], ['@Val_Plante'], ['@Val_Plante'], ['@gclacroix'], ['@gclacroix'], ['@CanadianPM'], ['@PMcanadien'], ['@HudonIsabelle'], ['@HudonIsabelle'], ['@DenisLemieuxLib'], ['@DenisLemieuxLib'], ['@Val_Plante'], ['@Val_Plante'], ['@Val_Plante'], ['@Val_Plante'], ['@SeamusORegan'], ['@SeamusORegan'], ['@HarjitSajjan', '@SevaFoodBank'], ['@AhmedDHussen', '@RefugeesChief'], ['@NANComms', '@JustinTrudeau', '@janephilpott', '@Carolyn_Bennett', '@gcfiddler', '@DGCAnnaBetty'], ['@CQualtro', '@amazonca'], ['@CQualtro'], ['@USAmbCanada'], ['@USAmbCanada'], ['@RajLiberal'], ['@RajLiberal'], ['@LindaJeffrey', '@JustinTrudeau'], ['@SeamusORegan', '@SeamusORegan'], ['@SeamusORegan', '@SeamusORegan'], ['@NavdeepSBains', '@googlecanada'], ['@NavdeepSBains', '@googlecanada'], ['@ericschmidt'], ['@ericschmidt'], ['@googlecanada', '@JustinTrudeau', '@ericschmidt', '@nytimes'], ['@VeteransENG_CA'], ['@VeteransFR_CA']]

- Convert values between data types in R or Python.

In [30]:
# Using python built in methods
print(type(tweets.id[0]))
print(type(str(tweets.id[0])))

# Using pandas

print(type(tweets.id[0].astype(str)))

<class 'numpy.int64'>
<class 'str'>
<class 'numpy.str_'>

- Clean categorical and text data by manipulating strings in R or Python

In [31]:
# checking dtypes
display(tweets.dtypes)

# cleaning text data

# to lowecase
tweets['status_clean'] = tweets.status.str.lower()

# removing punctuation, symbols and numbers 
tweets['status_clean'] = tweets.status_clean.str.replace(r"[^\w\s]|\d", '', regex = True)

# Changing author to categorical
tweets['author'] = tweets.author.astype('category')

# checking dtypes
display(tweets.dtypes)

id         int64
author    object
status    object
dtype: object

id                 int64
author          category
status            object
status_clean      object
dtype: object

- Clean date and time data in R or Python

In [32]:
from datetime import datetime, timedelta

# Generate datetime range
start_date = datetime(2023, 1, 1, hour=12, minute=30, second=0)
end_date = start_date + timedelta(days=99)
date_range = pd.date_range(start=start_date, end=end_date, freq='D')

# Create a DataFrame with datetime objects
date_time_df = pd.DataFrame({
    'datetime_column': date_range,
})

import holidays

holiday_list = holidays.UnitedStates()

# Creating columns with specified dates
date_time_df['year'] = date_time_df['datetime_column'].dt.year
date_time_df['month'] = date_time_df['datetime_column'].dt.month
date_time_df['month_name'] = date_time_df['datetime_column'].dt.month_name()
date_time_df['quarter'] = date_time_df['datetime_column'].dt.quarter
date_time_df['day'] = date_time_df['datetime_column'].dt.day
date_time_df['Holiday'] = date_time_df.datetime_column.dt.date.isin(holiday_list).astype(int)
date_time_df['day_name'] = date_time_df['datetime_column'].dt.day_name()
date_time_df['day_of_week'] = date_time_df['datetime_column'].dt.weekday
date_time_df['hour'] = date_time_df['datetime_column'].dt.hour
date_time_df['min'] = date_time_df['datetime_column'].dt.minute


date_time_df.head()

,datetime_column,year,month,month_name,quarter,day,Holiday,day_name,day_of_week,hour,min
0,2023-01-01 12:30:00,2023,1,January,1,1,0,Sunday,6,12,30
1,2023-01-02 12:30:00,2023,1,January,1,2,0,Monday,0,12,30
2,2023-01-03 12:30:00,2023,1,January,1,3,0,Tuesday,1,12,30
3,2023-01-04 12:30:00,2023,1,January,1,4,0,Wednesday,2,12,30
4,2023-01-05 12:30:00,2023,1,January,1,5,0,Thursday,3,12,30

## 2.3 Assess data quality and perform validation tasks

- Identify and replace missing values using R or Python.

In [33]:
# missing df
# Create a NumPy array with shape (1000,5)
data = np.random.randint(0, 100, (1000, 5))

# Create a Pandas DataFrame from the NumPy array
df = pd.DataFrame(data, columns=['A','B','C','D','E'])

print('Original mean')
print(np.mean(df, axis=0))

# Set some of the values to missing
df.loc[500:550, 'A'] = np.nan
df.loc[250:300, 'B'] = np.nan
df.loc[500:550, 'C'] = np.nan
df.loc[250:300, 'D'] = np.nan
df.loc[500:550, 'E'] = np.nan

# Check missing values
print('\nCount of missing values:')
display(df.isna().sum())

# Inputing using mean
df['A'] = df['A'].fillna(np.nanmean(df.A))

# Inputing using median
df['B'] = df['B'].fillna(np.nanmedian(df.B))

# Inputing using mode
df['C'] = df['B'].fillna(df.C.mode())

# Inputing using k-nearest
from sklearn.impute import KNNImputer
imputer = KNNImputer()
imputer.fit(df['D'].values.reshape(-1,1))
KNN_results = imputer.transform(df.D.values.reshape(-1,1))
df['D'] = KNN_results

# Inputing using bayesian methods
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer #  default=BayesianRidge()
imp_mean = IterativeImputer(random_state=0)
bayesian_results = pd.DataFrame(imp_mean.fit_transform(df.E.values.reshape(-1,1)))
df['E'] = bayesian_results

print('\nInputed mean')
print(np.mean(df, axis=0))

# Checking the missing values 
print('\nCount of missing values:')
display(df.isna().sum())

Original mean
A    49.468
B    50.795
C    49.792
D    47.622
E    49.958
dtype: float64

Count of missing values:

A    51
B    51
C    51
D    51
E    51
dtype: int64

Inputed mean
A    49.197050
B    50.508000
C    50.508000
D    47.593256
E    50.277134
dtype: float64

Count of missing values:

A    0
B    0
C    0
D    0
E    0
dtype: int64

- Perform different types of data validation tasks (e.g. consistency, constraints, range validation, uniqueness) using R or Python.

In [34]:
# data used for validation
df = pd.DataFrame({
    "Name": ["John Doe", "Jane Doe", "John Smith", "Jane Smith"],
    "Age": [30, 25, 40, 35],
    "City": ["New York", "Los Angeles", "Chicago", "San Francisco"],
    "State": ["NY", "CA", "IL", "CA"],
    "Not_unique" : [1,1,1,1]
})

-  Consistency

This type of validation checks to see if the data is consistent within itself. For example, you could check to see if all of the values in a column are of the same data type, or if all of the values in a column fall within a certain range.

In [35]:
def check_consistency(data_values, expected_type):
    """Checks to see if all of the values in a column are of the same data type."""
    for v in data_values:
        tp = type(v)
        if tp != expected_type:
            return False
        else:
            return True    

check_consistency(df.Age, float)

False

- Constraints

This type of validation checks to see if the data meets certain constraints. For example, you could check to see if a value is greater than or equal to a certain threshold, or if a value is a valid email address.

In [36]:
def check_constrain(data_values, constrain):
    for v in data_values:
        if v <= constrain :
            return True
        else:
            return False

check_constrain(df.Age, 5)

False

- Range validation

This type of validation checks to see if the data falls within a certain range. For example, you could check to see if a value is between 0 and 100, or if a value is between a certain minimum and maximum value.

In [37]:
def check_range(data_values, dt_range):
    for v in data_values:
        if v <= max(dt_range) | v >= min(dt_range):
            return True
        else:
            return False

check_range(df.Age,[0,100])

True

- Uniqueness

This type of validation checks to see if the data is unique. For example, you could check to see if each value in a column is unique, or if each value in a column is unique within a certain group of values.

In [38]:
df.Not_unique.is_unique

False

In [39]:
list(df.dtypes)

[dtype('O'), dtype('int64'), dtype('O'), dtype('O'), dtype('int64')]

- Identify and validate data types in a data set using Python.

In [40]:
def check_dtype(data_type, expected):
    if data_type == expected:
        return True
    else:
        return False

dtype = ['O','int64','str', 'O', 'int64']

check_dtype(dtype, list(df.dtypes))

False

## 2.4 Collect data from non-standard formats by modifying existing code

- Adapt provided code to import data from an API using Python.

In [41]:
import requests

url = 'https://receitaws.com.br/v1/cnpj/' # format = https://receitaws.com.br/v1/cnpj/{cnpj}

cnpj = '24519654000194'

response = requests.get(url+cnpj)

if response.status_code == 200:
    data = response.json()
    print(data)
else:
    print(response.status_code)

{'abertura': '20/06/1991', 'situacao': 'ATIVA', 'tipo': 'MATRIZ', 'nome': 'SECRETARIA DE ESTADO DE TRIBUTACAO', 'fantasia': 'SECRETARIA DE ESTADO DE TRIBUTACAO GAB SECRETARIO', 'porte': 'DEMAIS', 'natureza_juridica': '102-3 - Órgão Público do Poder Executivo Estadual ou do Distrito Federal', 'atividade_principal': [{'code': '84.11-6-00', 'text': 'Administração pública em geral'}], 'qsa': [{'nome': 'JOSE JACAUNA DE ASSUNCAO', 'qual': '05-Administrador'}], 'logradouro': 'LOC CENTRO ADMINISTRATIVO', 'numero': 'SN', 'municipio': 'NATAL', 'bairro': 'LAGOA NOVA', 'uf': 'RN', 'cep': '59.037-155', 'data_situacao': '27/02/1999', 'efr': 'RIO GRANDE DO NORTE', 'cnpj': '24.519.654/0001-94', 'ultima_atualizacao': '2023-07-09T23:59:59.000Z', 'status': 'OK', 'complemento': '', 'email': '', 'telefone': '', 'motivo_situacao': '', 'situacao_especial': '', 'data_situacao_especial': '', 'atividades_secundarias': [{'code': '00.00-0-00', 'text': 'Não informada'}], 'capital_social': '0.00', 'extra': {}, 'billing': {'free': True, 'database': True}}

-  Identify the structure of HTML and JSON data and parse them into a usable format for data processing and analysis using Python.

In [42]:
# The data from this api is returned in a json format, an is parsed into json using the .json method of the response object
# Passing this data to a pandas DF
import pandas as pd

n_data = {}
for item in data:
    n_data[item] = data[item]

# treating n_data to work on a pandas df

cols = list(n_data.keys())
vals = list(n_data.items())

res_df = pd.DataFrame(data=vals).T
res_df.columns = res_df.iloc[0,:]
res_df.drop(index=0)

,abertura,situacao,tipo,nome,fantasia,porte,natureza_juridica,atividade_principal,qsa,logradouro,...,complemento,email,telefone,motivo_situacao,situacao_especial,data_situacao_especial,atividades_secundarias,capital_social,extra,billing
1,20/06/1991,ATIVA,MATRIZ,SECRETARIA DE ESTADO DE TRIBUTACAO,SECRETARIA DE ESTADO DE TRIBUTACAO GAB SECRETARIO,DEMAIS,102-3 - Órgão Público do Poder Executivo Estad...,"[{'code': '84.11-6-00', 'text': 'Administração...","[{'nome': 'JOSE JACAUNA DE ASSUNCAO', 'qual': ...",LOC CENTRO ADMINISTRATIVO,...,,,,,,,"[{'code': '00.00-0-00', 'text': 'Não informada'}]",0.00,{},"{'free': True, 'database': True}"